#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
	// Создан копированием++
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
			И ТипЗнч(Параметры.ЗначениеКопирования) = Тип("СправочникСсылка.PAPI_Алгоритмы") Тогда	
			
			ПриЧтенииНаСервере(Параметры.ЗначениеКопирования);
				
		КонецЕсли;
	// Создан копированием--	
	КонецЕсли;		

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Объект.ЭтоГруппа Тогда
		ПоместитьСтруктураАлгоритмаВНастройки(ТекущийОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не ТекущийОбъект.ЭтоГруппа Тогда

		СтруктураНастройки = PAPI_РаботаСАлгоритмами.СтруктураНастроекАлгоритма(ТекущийОбъект.Настройки);

		Если СтруктураНастройки.Свойство("СА_КодАлгоритма") Тогда
			КодАлгоритма = СтруктураНастройки.СА_КодАлгоритма;	
		КонецЕсли;	
		
		Если СтруктураНастройки.Свойство("СА_ПараметрыАлгоритма") Тогда
			ПараметрыАлгоритма.Загрузить(СтруктураНастройки.СА_ПараметрыАлгоритма);	
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыАлгоритма

&НаКлиенте
Процедура ПараметрыАлгоритмаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыАлгоритма.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.Вычисляемый Тогда 
		 
		ТекущийПроизвольныйКод = ТекущиеДанные.ПроизвольныйКод;
		
	Иначе
		
		ТекущийПроизвольныйКод = ""; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПроизвольныйКодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыАлгоритма.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
		И ТекущиеДанные.Вычисляемый Тогда
		
		ТекущиеДанные.ПроизвольныйКод = ТекущийПроизвольныйКод;  
		
	Иначе   
		
		ТекущиеДанные.ПроизвольныйКод = "";
		
	КонецЕсли;                         

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАлгоритмаПроизвольныйКодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыАлгоритма.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
		И ТекущиеДанные.Вычисляемый Тогда
		
		ТекущийПроизвольныйКод = ТекущиеДанные.ПроизвольныйКод;  
		
	Иначе   
		
		ТекущийПроизвольныйКод = "";
		
	КонецЕсли

КонецПроцедуры


&НаКлиенте
Процедура ПараметрыАлгоритмаВычисляемыйПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыАлгоритма.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
		И ТекущиеДанные.Вычисляемый Тогда
		
		ТекущийПроизвольныйКод = ТекущиеДанные.ПроизвольныйКод;  
		
	Иначе   
		
		ТекущийПроизвольныйКод = "";
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоместитьСтруктураАлгоритмаВНастройки(ТекущийОбъект)
		
// СтруктураАлгоритма ++		                    
	СтруктураДанных = Новый Структура;
	СтруктураАлгоритма = Новый Структура;
	СтруктураАлгоритма.Вставить("КодАлгоритма",КодАлгоритма);
	
	СтруктураАлгоритма.Вставить("ПараметрыАлгоритма", ПараметрыАлгоритма.Выгрузить(,"Имя, Значение, Вычисляемый, ПроизвольныйКод"));
	
	СтруктураДанных.Вставить("СтруктураАлгоритма", СтруктураАлгоритма);
// СтруктураАлгоритма --

	ДанныеXML = PAPI_ОбщегоНазначенияВызовСервера.СериализаторXML(СтруктураДанных);
	ТекущийОбъект.Настройки = Новый ХранилищеЗначения(?(ДанныеXML.Отработал, ДанныеXML.Результат, ""));
	
КонецПроцедуры 



#КонецОбласти