#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
// Возвращает стандартную ошибку  
//
// Возвращаемое значение:
//   Структура:
//		КодСостояния - Код ответа 520
//		Сообщение - Текст ошибки
//
Функция ПолучитьСообщение502() Экспорт 
	
	ТекстСообщения = НСтр("ru = 'Неизвестная ошибка';
			|en = 'Unknown Error'");
	Результат = Новый Структура("КодСостояния, Сообщение", 520, ТекстСообщения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КодСостояния КАК КодСостояния,
		|   ТекстСообщения КАК Сообщение
		|ИЗ
		|	Справочник.PAPI_ШаблоныСообщений
		|ГДЕ
		|	Код = &Код
		|	И НЕ ПометкаУдаления
		|";
	Запрос.УстановитьПараметр("Код","UnErr520");
	
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаКодСостояния
	    Если Результат.КодСостояния <> ВыборкаДетальныеЗаписи.КодСостояния Тогда 
			Результат.КодСостояния = ВыборкаДетальныеЗаписи.КодСостояния;	
		КонецЕсли;

		Если ПустаяСтрока(ВыборкаДетальныеЗаписи.Сообщение) Тогда 
			Продолжить;
		КонецЕсли;   
		
		ТекстСообщения = НСтр(ВыборкаДетальныеЗаписи.Сообщение);
		Результат.Сообщение = ТекстСообщения;

	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли