
&НаКлиенте
Процедура ПрочитатьПакет(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		
		ПрочитатьПакетНаСервере(ТекущиеДанные.Идентификатор, ТекущиеДанные.КодОтправителя);
		
		Элементы.Список.Обновить();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьПакетНаСервере(ИдентификаторСообщения, КодОтправителя)
	
    РегистрыСведений.PAPI_ВходящиеСообщенияСервисаИнтеграции.ЗапуститьПовторнуюЗагрузку(ИдентификаторСообщения, КодОтправителя);

КонецПроцедуры


// Открыть объект. Работает только если тип объекта совпадает с типом текущей конфигурации
//
// Параметры:
//  Команда	 - КомандаФормы - получаем навигационную ссылку и пытаемся ее открыть.
//
&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.ТипОбъекта)
		И ЗначениеЗаполнено(ТекущиеДанные.ИдОбъекта) Тогда 
		
		ТекущаяНавигационнаяСсылка = PAPI_ОбщегоНазначенияВызовСервера.НайтиОбъектИПолучитьНавигационнуюСсылку(ТекущиеДанные.ТипОбъекта, ТекущиеДанные.ИдОбъекта);
		Если СтрНайти(ТекущаяНавигационнаяСсылка, "e1cib/data") > 0 Тогда

			ПерейтиПоНавигационнойСсылке(ТекущаяНавигационнаяСсылка);
			
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры 
