#Область License

//MIT License

//Copyright (c) 2024-2026 Dmitrii Sidorenko

//Permission is hereby granted, free of charge, to any person obtaining a copy
//of this software and associated documentation files (the "Software"), to deal
//in the Software without restriction, including without limitation the rights
//to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
//copies of the Software, and to permit persons to whom the Software is
//furnished to do so, subject to the following conditions:

//The above copyright notice and this permission notice shall be included in all
//copies or substantial portions of the Software.

//THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
//IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
//FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
//AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
//LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
//OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
//SOFTWARE.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Использовать = Истина; 
	Элементы.ВходящийЗапрос.Доступность = Использовать;
	
	//Элементы.Метод.Доступность 						= НЕ Использовать;
	//Элементы.СтраницаЗаголовкиЗапроса.Доступность 	= НЕ Использовать;
	//Элементы.СтраницаПараметрыЗапроса.Доступность 	= НЕ Использовать;
	//Элементы.СтраницаТелоЗапроса.Доступность 		= НЕ Использовать;
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящийЗапросПриИзменении(Элемент)
	ЗаполнитьДанныеПоВходящемуЗапросу();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСписокСообщений

&НаКлиенте
Процедура ПроизвольныйЗапросПриИзменении(Элемент)
	
	Элементы.ВходящийЗапрос.Доступность = Использовать;
	
	//Элементы.Метод.Доступность 						= НЕ Использовать;
	//Элементы.СтраницаЗаголовкиЗапроса.Доступность 	= НЕ Использовать;
	//Элементы.СтраницаПараметрыЗапроса.Доступность 	= НЕ Использовать;
	//Элементы.СтраницаТелоЗапроса.Доступность 		= НЕ Использовать;  
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	Если ЗначениеЗаполнено(ВходящийЗапрос) Тогда 
		ВыполнитьВходящийЗапросНаСервере();   
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоВходящемуЗапросу()
		
	РезультатJS = PAPI_ОбщегоНазначенияВызовСервера.ЧтениеДанныхИзJSON(ВходящийЗапрос.Запрос);
	
	Если РезультатJS.Отработал Тогда
		
		СтруктураВходныхПараметров = РезультатJS.Результат;
		
		Если ВходящийЗапрос.ЕстьТелоЗапроса Тогда 
			
			ТелоЗапроса = ВходящийЗапрос.ТелоЗапроса.Получить();	
					
		КонецЕсли; 
		
		Метод = ВходящийЗапрос.Метод;
		Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда 
			ПараметрыЗапроса.Очистить();
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗаголовкиЗапроса) Тогда 
			ЗаголовкиЗапроса.Очистить();
		КонецЕсли;	
		
		Для Каждого текПараметр Из СтруктураВходныхПараметров.ПараметрыЗапроса Цикл 
			
			НовыйПараметр = ПараметрыЗапроса.Добавить();
			НовыйПараметр.Использовать 	= Истина;
			НовыйПараметр.Ключ 			= текПараметр.Ключ;
			НовыйПараметр.Значение 		= текПараметр.Значение;
			
		КонецЦикла;	
		
		Для Каждого текЗаголовок Из СтруктураВходныхПараметров.ЗаголовкиЗапроса Цикл 
			
			НовыйЗаголовок = ЗаголовкиЗапроса.Добавить();
			НовыйЗаголовок.Использовать = Истина;
			НовыйЗаголовок.Имя 			= текЗаголовок.Имя;
			НовыйЗаголовок.Значение 	= текЗаголовок.Значение;
			
		КонецЦикла;
		
		ИмяМетода 		= СтруктураВходныхПараметров.ИмяМетода;
		ВерсияМетода	= СтруктураВходныхПараметров.ВерсияМетода;
		МетодЗапроса 	= СтруктураВходныхПараметров.МетодЗапроса;
		БазовыйURL 		= СтруктураВходныхПараметров.БазовыйURL;
		ОтносительныйURL= СтруктураВходныхПараметров.ОтносительныйURL;
		
		Элементы.СтраницаЗапроса.Видимость 	= Истина; 
		
	Иначе	
		
		PAPI_ОбщегоНазначенияКлиентСервер.КраткоеСообщениеПользователю(РезультатJS.ТекстОшибки);
		Элементы.СтраницаЗапроса.Видимость 	= Ложь;
		Элементы.СтраницаОтвет.Видимость 	= Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры	


// Выполнить входящий или произвольный запрос
//
&НаСервере
Процедура ВыполнитьВходящийЗапросНаСервере()
	
	Если Использовать Тогда 
		
		РезультатJS = PAPI_ОбщегоНазначенияВызовСервера.ЧтениеДанныхИзJSON(ВходящийЗапрос.Запрос);
		
		Если РезультатJS.Отработал Тогда
			
			СтруктураВходныхПараметров = РезультатJS.Результат;
	
			Если ВходящийЗапрос.ЕстьТелоЗапроса Тогда 
			
				перТелоЗапроса = ВходящийЗапрос.ТелоЗапроса.Получить();	
				СтруктураВходныхПараметров.Вставить("ТелоЗапроса", перТелоЗапроса);
						
			КонецЕсли;
			
			Элементы.СтраницаОтвет.Видимость = Истина;
			СтруктураОтвет = PAPI_РаботаСМетодами.ВыполнитьМетод(ВходящийЗапрос.Метод, СтруктураВходныхПараметров);
	        
			Отработал 		= СтруктураОтвет.Отработал;
			КодОтвета 		= СтруктураОтвет.КодОтвета;
			ДанныеОтвета 	= СтруктураОтвет.ДанныеОтвета;
			ТекстОшибки 	= СтруктураОтвет.ТекстОшибки;
				
			ЗаголовкиОтвета.Очистить();
			
			Если СтруктураОтвет.Свойство("ЗаголовкиОтвета") Тогда 
				Для Каждого ТекущийЗаголовок Из СтруктураОтвет.ЗаголовкиОтвета Цикл 
					НоваяСтрока = ЗаголовкиОтвета.Добавить();
				    ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийЗаголовок); 
				КонецЦикла;
			КонецЕсли;	
		
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтвет;
						
		Иначе 
			
			PAPI_ОбщегоНазначенияКлиентСервер.КраткоеСообщениеПользователю(РезультатJS.ТекстОшибки);
			Элементы.СтраницаОтвет.Видимость = Ложь;
				
		КонецЕсли;	
			
	Иначе 
		
		СтруктураВходныхПараметров = Новый Структура;	
		СтруктураВходныхПараметров.Вставить("ТелоЗапроса", ТелоЗапроса);
			
		СвоиЗаголовкиЗапроса = Новый Массив;
		Для Каждого текЗаголовок Из ЗаголовкиЗапроса Цикл 
				
			Если текЗаголовок.Использовать Тогда 
					
				СвоиЗаголовкиЗапроса.Добавить(Новый Структура("Имя,Значение",текЗаголовок.Имя,текЗаголовок.Значение)); 
						
			КонецЕсли;	
				
		КонецЦикла;
		СтруктураВходныхПараметров.Вставить("ЗаголовкиЗапроса", СвоиЗаголовкиЗапроса);
		
		СвоиПараметрыЗапроса = Новый Структура;
		Для Каждого текПараметр Из ПараметрыЗапроса Цикл 
				
			Если текПараметр.Использовать Тогда 
					
				СвоиПараметрыЗапроса.Вставить(текПараметр.Ключ,текПараметр.Значение); 
						
			КонецЕсли;	
				
		КонецЦикла;
		СтруктураВходныхПараметров.Вставить("ПараметрыЗапроса", СвоиПараметрыЗапроса);	
		
		СтруктураВходныхПараметров.Вставить("ОтносительныйURL", ОтносительныйURL);
		СтруктураВходныхПараметров.Вставить("БазовыйURL", 		БазовыйURL);
		СтруктураВходныхПараметров.Вставить("МетодЗапроса", 	МетодЗапроса);
		СтруктураВходныхПараметров.Вставить("ИмяМетода", 		ИмяМетода);
		СтруктураВходныхПараметров.Вставить("ВерсияМетода", 	ВерсияМетода);
		
		МетодЗаполнен = Ложь;
		Если ЗначениеЗаполнено(Метод)
			И PAPI_ОбщегоНазначенияВызовСервера.СсылкаСуществует(Метод) Тогда 
			
			МетодЗаполнен = Истина;
            СтруктураОтвет = PAPI_РаботаСМетодами.ВыполнитьМетод(Метод, СтруктураВходныхПараметров); 
			
		Иначе 
			
			Метод = PAPI_РаботаСМетодами.ПоискМетодаPAPI(СтруктураВходныхПараметров);
			Если ЗначениеЗаполнено(Метод)
				И PAPI_ОбщегоНазначенияВызовСервера.СсылкаСуществует(Метод) Тогда 
			    МетодЗаполнен = Истина;
            	СтруктураОтвет = PAPI_РаботаСМетодами.ВыполнитьМетод(Метод, СтруктураВходныхПараметров);
			КонецЕсли;		
		КонецЕсли;
		
		Если МетодЗаполнен Тогда 
			Элементы.СтраницаОтвет.Видимость = Истина;
			 
			Отработал 		= СтруктураОтвет.Отработал;
			КодОтвета 		= СтруктураОтвет.КодОтвета;
			ДанныеОтвета 	= СтруктураОтвет.ДанныеОтвета;
			ТекстОшибки 	= СтруктураОтвет.ТекстОшибки;
			
			ЗаголовкиОтвета.Очистить();
			
			Если СтруктураОтвет.Свойство("ЗаголовкиОтвета") Тогда 
				Для Каждого ТекущийЗаголовок Из СтруктураОтвет.ЗаголовкиОтвета Цикл 
					НоваяСтрока = ЗаголовкиОтвета.Добавить();
				    ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийЗаголовок); 
				КонецЦикла;
			КонецЕсли;	
		
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтвет;
		Иначе	
		
			PAPI_ОбщегоНазначенияКлиентСервер.КраткоеСообщениеПользователю("Метод не найден!");
			Элементы.СтраницаОтвет.Видимость = Ложь;
		КонецЕсли;     
		
	КонецЕсли;	
	
КонецПроцедуры  






#КонецОбласти

