#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Перечень всех методов, не нужные можно комментировать 
// Возвращаемое значение:
//  МассивМетодов - Массив - Массив доступных http методов
Функция МассивВсехМетодов() Экспорт
	
	МассивМетодов = Новый Массив;
	МассивМетодов.Добавить("GET");
	МассивМетодов.Добавить("POST");
	МассивМетодов.Добавить("HEAD");
	МассивМетодов.Добавить("PUT");
	МассивМетодов.Добавить("DELETE");
	МассивМетодов.Добавить("PATCH");
	МассивМетодов.Добавить("MERGE");
	МассивМетодов.Добавить("OPTIONS");
	МассивМетодов.Добавить("TRACE");
	МассивМетодов.Добавить("CONNECT");
	
	Возврат МассивМетодов;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли