// Все значения списком
// 
// Возвращаемое значение:
//  СписокЗначений - Все значения перечисления
//
Функция ВсеЗначенияСписком() Экспорт
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ссылка КАК Значение,
		|	ПРЕДСТАВЛЕНИЕ(Ссылка) КАК Представление
		|ИЗ
		|	Перечисление.PAPI_ТипПодпискиНаСобытие";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Результат.Добавить(ВыборкаДетальныеЗаписи.Значение, ВыборкаДетальныеЗаписи.Представление); 
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Все значения перечисления в виде соответствия
// 
// Возвращаемое значение:
//  Соответствие - Все значения перечисления
//
Функция ВсеЗначенияСоответствием() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ссылка КАК Значение
		|ИЗ
		|	Перечисление.PAPI_ТипПодпискиНаСобытие";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Результат.Вставить(XMLСтрока(ВыборкаДетальныеЗаписи.Значение), ВыборкаДетальныеЗаписи.Значение);
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции