
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Направление) Тогда 
		Объект.Направление = "Получение";
	КонецЕсли;	
	
	Если Метаданные.СервисыИнтеграции.Количество() > 0 Тогда 
		
		Для Каждого СервисИнтеграции Из Метаданные.СервисыИнтеграции Цикл 
			
			Элементы.Сервис.СписокВыбора.Добавить(СервисИнтеграции.Имя,СервисИнтеграции.Имя);
			
		КонецЦикла;	
			
		СервисПриИзмененииНаСервере();

	КонецЕсли;    
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СервисПриИзменении(Элемент)
	
	СервисПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)

	СервисПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СервисПриИзмененииНаСервере()
	
	Если Элементы.Канал.СписокВыбора.Количество() > 0 Тогда
		
		Элементы.Канал.СписокВыбора.Очистить();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Направление) Тогда 
		
		Объект.Направление = "Получение";
		
	КонецЕсли;
	
	текСервис = Метаданные.СервисыИнтеграции.Найти(Объект.Сервис);
			
	Если текСервис <> Неопределено Тогда 
		
		КаналаСервисаИнтеграцииОтправка = Метаданные.СвойстваОбъектов.НаправлениеСообщенияКаналаСервисаИнтеграции[Объект.Направление];   
		
		Для Каждого текКаналСервиса Из текСервис.КаналыСервисаИнтеграции Цикл 
					
			Если текКаналСервиса.НаправлениеСообщения = КаналаСервисаИнтеграцииОтправка Тогда 
						
				Элементы.Канал.СписокВыбора.Добавить(текКаналСервиса.Имя, текКаналСервиса.Имя);				
						
			КонецЕсли;
					
		КонецЦикла;
				
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
