#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторСообщения = Строка(Запись.Идентификатор);
	ИдентификаторЗапроса = Строка(Запись.ИдентификаторСообщенияЗапроса);     
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	
	текСообщение = ТекущийОбъект.Сообщение.Получить();    
	
	Если ЗначениеЗаполнено(текСообщение) 
		И ТипЗнч(текСообщение) = Тип("Структура") Тогда 
		
		Если текСообщение.Свойство("ТелоСообщения") Тогда 
			
			ТелоСообщения = текСообщение.ТелоСообщения;
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовКоманднаяПанельПараметры

&НаКлиенте
Процедура ОткрытьОбъект(Команда)  
	
	Если ЗначениеЗаполнено(Запись.ТипОбъекта)
		И ЗначениеЗаполнено(Запись.ИдОбъекта) Тогда 
		
		ТекущаяНавигационнаяСсылка = PAPI_ОбщегоНазначенияВызовСервера.НайтиОбъектИПолучитьНавигационнуюСсылку(Запись.ТипОбъекта, Запись.ИдОбъекта);
		Если СтрНайти(ТекущаяНавигационнаяСсылка, "e1cib/data") > 0 Тогда

			ПерейтиПоНавигационнойСсылке(ТекущаяНавигационнаяСсылка);
			
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 