
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.ЕстьТелоЗапроса Тогда
		
		ТелоЗапроса = ТекущийОбъект.ТелоЗапроса.Получить();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПоместитьТелоВТелоЗапроса(ТекущийОбъект)	
		
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура ТелоЗапросаПриИзменении(Элемент)
	
	Если Не Модифицированность Тогда 
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры



#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоместитьТелоВТелоЗапроса(ТекущийОбъект)
	
	Если ТекущийОбъект.ЕстьТелоЗапроса Тогда
		
		ТекущийОбъект.ТелоЗапроса = Новый ХранилищеЗначения(ТелоЗапроса); 
		
	КонецЕсли;
	
КонецПроцедуры 


#КонецОбласти
