
&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.ТипОбъекта)
		И ЗначениеЗаполнено(ТекущиеДанные.ИдОбъекта) Тогда 
		
		СтруктураРегистра = ПолучитьСтруктуруПоУмолчанию();
		ЗаполнитьЗначенияСвойств(СтруктураРегистра, ТекущиеДанные);
		
		ТипОбъекта = "";
	    ИдОбъекта  = "";
		ПолучитьСтруктуруТипУИ(СтруктураРегистра, ТипОбъекта, ИдОбъекта);
		
		ТекущаяНавигационнаяСсылка = PAPI_ОбщегоНазначенияВызовСервера.НайтиОбъектИПолучитьНавигационнуюСсылку(ТипОбъекта, ИдОбъекта);
		Если СтрНайти(ТекущаяНавигационнаяСсылка, "e1cib/data") > 0 Тогда

			ПерейтиПоНавигационнойСсылке(ТекущаяНавигационнаяСсылка);
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПоУмолчанию()
	
	Возврат РегистрыСведений.PAPI_ОшибкиОбработкиПослеЗаписиВерсий.ПолучитьСтруктуруПоУмолчанию();	
	
КонецФункции

&НаСервере
Процедура ПолучитьСтруктуруТипУИ(СтруктураЗаписи, ТипОбъекта, ИдОбъекта)

	СтруктураДанных = PAPI_ОбщегоНазначенияВызовСервера.СтруктураНавигационнойСсылки(СтруктураЗаписи.ИдОбъекта, "Ссылка");	
		
	Если СтруктураДанных.Отработал 
		И СтруктураДанных.Свойство("Результат") Тогда 
		
		ТипОбъекта = СтруктураДанных.Результат.ТипОбъекта;
	    ИдОбъекта  = СтруктураДанных.Результат.ИдОбъекта;   
		
	Иначе
		
		ТипОбъекта = СтруктураЗаписи.ТипОбъекта;
	    ИдОбъекта  = СтруктураЗаписи.ИдОбъекта; 
		
	КонецЕсли;
	
КонецПроцедуры	