#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура PAPI_ИсточникПриИзменении(Элемент)
	
	ИмяКонстанты = Элемент.Имя;
	ОбновитьЗначениеКонстанты(ИмяКонстанты);
	ЗаполнитьПараметрСеансаЗначениемКонстанты(ИмяКонстанты, ИмяКонстанты);
	
	Если Модифицированность Тогда 
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура PAPI_ОбменыВключеныПриИзменении(Элемент)
	
	ИмяКонстанты = Элемент.Имя;
	ОбновитьЗначениеКонстантыИПараметрСеанса(ИмяКонстанты);
	
	Если Модифицированность Тогда 
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура PAPI_ЛогированиеВходящихСообщенийСервисаИнтеграцииПриИзменении(Элемент)
	
	ИмяКонстанты = Элемент.Имя;
	ОбновитьЗначениеКонстанты(ИмяКонстанты);
	
	Если Модифицированность Тогда 
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура PAPI_ДатаЗапретаОбменаДокументовПриИзменении(Элемент)
	
	ИмяКонстанты = Элемент.Имя;
	ОбновитьЗначениеКонстанты(ИмяКонстанты);
	
	Если Модифицированность Тогда 
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура PAPI_КоличествоПопытокОчередиДокументовПриИзменении(Элемент)

	ИмяКонстанты = Элемент.Имя;
	ОбновитьЗначениеКонстанты(ИмяКонстанты);
	
	Если Модифицированность Тогда 
		Модифицированность = Ложь;
	КонецЕсли;

КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЗначениеКонстантыИПараметрСеанса(ИмяКонстанты)
	
	PAPI_ОбщегоНазначенияВызовСервера.ПоменятьЗначениеКонстанты(ИмяКонстанты, НаборКонстант[ИмяКонстанты]);    
	
	Если PAPI_ОбщегоНазначенияВызовСервера.ПрочитатьЗначениеКонстанты(ИмяКонстанты) Тогда 
		PAPI_СервисыИнтеграции.ВыполнитьОбработкуНаСервере();	
	Иначе
		PAPI_СервисыИнтеграции.ОстановитьОбработкуНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьЗначениеКонстанты(ИмяКонстанты)   
	
	PAPI_ОбщегоНазначенияВызовСервера.ПоменятьЗначениеКонстанты(ИмяКонстанты, НаборКонстант[ИмяКонстанты]); 
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрСеансаЗначениемКонстанты(ИмяКонстанты, ИмяПараметраСеанса)
	
	PAPI_ОбщегоНазначенияВызовСервера.ЗаполнитьПараметрСеансаЗначениемКонстанты(ИмяКонстанты, ИмяПараметраСеанса);  
	
КонецПроцедуры


#КонецОбласти